MAHFUZ121097/nRF52--Real-time-Ambulatory-Monitoring/main.c
#define SAADC_SAMPLES_IN_BUFFER         48
#define SAADC_SAMPLE_RATE               1                                         /**< SAADC sample rate in ms. */               

// si7021 initialization begins

//Initializing TWI1 instance for si7021
#define TWI_INSTANCE_ID1     1

#define SAMPLE_RATE 1000             // ECG sample rate: 1 kHz
#define BUFFER_SIZE 5000             // Buffer to store 5 seconds of ECG data (5000 samples)
#define ADC_BUFFER_SIZE 50           // Size of adc_buffer
#define THRESHOLD 512                // Threshold for R-peak detection (you can tune this)
#define MIN_RR_INTERVAL 250          // Minimum R-R interval in ms (240 bpm)
#define WINDOW_SIZE 150              // Moving window size for peak detection

uint16_t ir_data, red_data;
// Variables
volatile float ecgBuffer[BUFFER_SIZE];     // Buffer to store 5 seconds of ECG data
volatile int ecgBufferIndex = 0;           // Current index in the ECG buffer
volatile bool bufferFull = false;          // Flag to check if the ECG buffer is full
uint16_t adc_buffer[ADC_BUFFER_SIZE];      // ADC buffer to hold 50 samples at a time
// Filters and thresholds (parameters need tuning)
float lowPassFilter(float x);
float highPassFilter(float x);
float derivative(float x);
float movingWindowIntegrator(float x);


// A flag to indicate the transfer state
static volatile bool m_xfer_done = false;

// Create a Handle for the twi communication
static const nrf_drv_twi_t my_twi_0 = NRF_DRV_TWI_INSTANCE(TWI_INSTANCE_ID1);

/* Buffer to read sensor data. */
static uint8_t m_sample[2];

/* Indicates mode of operation on TWI. */
static uint8_t twi_read_mode;

/* stores the sensor readings. */
static uint16_t humRaw;
static uint16_t tempRaw;
static uint16_t humCent;
static uint16_t tempCent;
static uint16_t tempF;
// si7021 initialization ends


BLE_NUS_DEF(m_nus, NRF_SDH_BLE_TOTAL_LINK_COUNT);                                   /**< BLE NUS service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                                           /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                             /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                                                 /**< Advertising module instance. */

static uint16_t   m_conn_handle          = BLE_CONN_HANDLE_INVALID;                 /**< Handle of the current connection. */
static uint16_t   m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;            /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */
static ble_uuid_t m_adv_uuids[]          =                                          /**< Universally unique service identifier. */
{
    {BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}
};

volatile uint8_t state = 1;

static const nrf_drv_timer_t   m_timer = NRF_DRV_TIMER_INSTANCE(3);
static nrf_saadc_value_t       m_buffer_pool[2][SAADC_SAMPLES_IN_BUFFER];
static nrf_ppi_channel_t       m_ppi_channel;
static uint32_t                m_adc_evt_counter;
int16_t AccValue[3];
//uint16_t adc_value [SAADC_SAMPLES_IN_BUFFER];
uint16_t length = 116;
uint16_t adc_buffer[50];
uint8_t printf_buffer[116];
uint8_t data_ready;
//,adc_value2,adc_value3,adc_value4,adc_value5,adc_value6;

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{

    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        uint32_t err_code;

        NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
        NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);

        for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
        {
            do
            {
                err_code = app_uart_put(p_evt->params.rx_data.p_data[i]);
                if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
                {
                    NRF_LOG_ERROR("Failed receiving NUS message. Error 0x%x. ", err_code);
                    APP_ERROR_CHECK(err_code);
                }
            } while (err_code == NRF_ERROR_BUSY);
        }
        if (p_evt->params.rx_data.p_data[p_evt->params.rx_data.length - 1] == '\r')
        {
            while (app_uart_put('\n') == NRF_ERROR_BUSY);
        }
    }

