MAHFUZ121097/nRF52--Real-time-Ambulatory-Monitoring/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    UNUSED_RETURN_VALUE(NRF_LOG_PROCESS());
    nrf_pwr_mgmt_run();
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}


void timer_handler(nrf_timer_event_t event_type, void* p_context)
{

}


void saadc_sampling_event_init(void)
{
    ret_code_t err_code;
    err_code = nrf_drv_ppi_init();
    APP_ERROR_CHECK(err_code);
    
    nrf_drv_timer_config_t timer_config = NRF_DRV_TIMER_DEFAULT_CONFIG;
    timer_config.frequency = NRF_TIMER_FREQ_31250Hz;
    err_code = nrf_drv_timer_init(&m_timer, &timer_config, timer_handler);
    APP_ERROR_CHECK(err_code);

    /* setup m_timer for compare event */
    uint32_t ticks = nrf_drv_timer_ms_to_ticks(&m_timer,SAADC_SAMPLE_RATE);
    nrf_drv_timer_extended_compare(&m_timer, NRF_TIMER_CC_CHANNEL0, ticks, NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, false);
    nrf_drv_timer_enable(&m_timer);

    uint32_t timer_compare_event_addr = nrf_drv_timer_compare_event_address_get(&m_timer, NRF_TIMER_CC_CHANNEL0);
    uint32_t saadc_sample_event_addr = nrf_drv_saadc_sample_task_get();

    /* setup ppi channel so that timer compare event is triggering sample task in SAADC */
    err_code = nrf_drv_ppi_channel_alloc(&m_ppi_channel);
    APP_ERROR_CHECK(err_code);
    
    err_code = nrf_drv_ppi_channel_assign(m_ppi_channel, timer_compare_event_addr, saadc_sample_event_addr);
    APP_ERROR_CHECK(err_code);
}


void saadc_sampling_event_enable(void)
{
    ret_code_t err_code = nrf_drv_ppi_channel_enable(m_ppi_channel);
    APP_ERROR_CHECK(err_code);
}


void saadc_callback(nrf_drv_saadc_evt_t const * p_event)
{
    ret_code_t err_code;
    //uint16_t adc_value[SAADC_SAMPLES_IN_BUFFER];
    //uint8_t printf_buffer[SAADC_SAMPLES_IN_BUFFER*2];
        if (p_event->type == NRF_DRV_SAADC_EVT_DONE)
    {
        
               
               err_code =  nrf_drv_saadc_buffer_convert(p_event->data.done.p_buffer, SAADC_SAMPLES_IN_BUFFER);
               APP_ERROR_CHECK(err_code);
                //for (int j=0;j<SAADC_SAMPLES_IN_BUFFER;j++){
                //adc_value[j] = p_event->data.done.p_buffer[j];
                //printf_buffer[j] = p_event->data.done.p_buffer[j];
                //printf_buffer[j+1] = p_event->data.done.p_buffer[j/2] >> 8;
            }
            
        
        for (int i=0;i<SAADC_SAMPLES_IN_BUFFER;i++)
        {
            adc_buffer[i] = p_event->data.done.p_buffer[i];
            printf_buffer[i*2] = p_event->data.done.p_buffer[i];
            printf_buffer[i*2 + 1] = p_event->data.done.p_buffer[i] >> 8;


        }
        //nrf_gpio_pin_clear(5);
        
        
         data_ready=1;

m_adc_evt_counter++;
            
        /*
        else{
            printf_buffer[192] = 0x00;
            printf_buffer[193] = 0x00;
            printf_buffer[194] = 0x00;
            printf_buffer[195] = 0x00;
            printf_buffer[196] = 0x00;
            printf_buffer[197] = 0x00;
            printf_buffer[198] = 0x00;
            printf_buffer[199] = 0x00;

        }
	*/
        
    }


void saadc_init(void)
{
    ret_code_t err_code;
	
    nrf_drv_saadc_config_t saadc_config = NRF_DRV_SAADC_DEFAULT_CONFIG;
    saadc_config.resolution = NRF_SAADC_RESOLUTION_10BIT;
	
    nrf_saadc_channel_config_t channel_0_config =
        NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN2);
    channel_0_config.gain = NRF_SAADC_GAIN1_4;
    channel_0_config.reference = NRF_SAADC_REFERENCE_VDD4;
	/*
    nrf_saadc_channel_config_t channel_1_config =
        NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN5);
    channel_1_config.gain = NRF_SAADC_GAIN1_4;
    channel_1_config.reference = NRF_SAADC_REFERENCE_VDD4;
	
    nrf_saadc_channel_config_t channel_2_config =
        NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN6);
    channel_2_config.gain = NRF_SAADC_GAIN1_4;
    channel_2_config.reference = NRF_SAADC_REFERENCE_VDD4;
	
    nrf_saadc_channel_config_t channel_3_config =
        NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN7);
    channel_3_config.gain = NRF_SAADC_GAIN1_4;
    channel_3_config.reference = NRF_SAADC_REFERENCE_VDD4;				
	*/
    err_code = nrf_drv_saadc_init(&saadc_config, saadc_callback);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_channel_init(0, &channel_0_config);
    APP_ERROR_CHECK(err_code);
    /*
    err_code = nrf_drv_saadc_channel_init(1, &channel_1_config);
    APP_ERROR_CHECK(err_code);
    err_code = nrf_drv_saadc_channel_init(2, &channel_2_config);
    APP_ERROR_CHECK(err_code);
    err_code = nrf_drv_saadc_channel_init(3, &channel_3_config);
    APP_ERROR_CHECK(err_code);	
    */
    err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[0],SAADC_SAMPLES_IN_BUFFER);
    APP_ERROR_CHECK(err_code);   
    err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[1],SAADC_SAMPLES_IN_BUFFER);
    APP_ERROR_CHECK(err_code);
}


//Event Handler for si7021
void twi_si7021_handler(nrf_drv_twi_evt_t const * p_event, void * p_context)
{
    uint32_t err_code;
        uint8_t reg[2];
        
    NRF_LOG_DEBUG("twi_handler %u\n\r",p_event->type);
    //Check the event to see what type of event occurred
    switch (p_event->type)
    {
        case NRF_DRV_TWI_EVT_DONE:
            NRF_LOG_DEBUG("twi_handler NRF_DRV_TWI_EVT_DONE %u\n\r",p_event->xfer_desc.type);
            if (p_event->xfer_desc.type == NRF_DRV_TWI_XFER_TX) {
                NRF_LOG_DEBUG("twi_handler TX\n\r");
                if (twi_read_mode==SI7021_REG_HUM_READ || twi_read_mode==SI7021_REG_TEMP_READ) {
                	err_code = nrf_drv_twi_rx(&my_twi_0, SI7021_ADDR, m_sample, sizeof(m_sample));
                	APP_ERROR_CHECK(err_code);
                }
            } else if (p_event->xfer_desc.type == NRF_DRV_TWI_XFER_RX) {
                NRF_LOG_DEBUG("twi_handler RX %d,%d\n\r",m_sample[0],m_sample[1]);
                if (twi_read_mode==SI7021_REG_HUM_READ) {
                	humRaw=(uint16_t)m_sample[0] << 8 |m_sample[1];
    				reg[0] = SI7021_REG_TEMP_READ;
    				twi_read_mode = reg[0];
    				NRF_LOG_DEBUG("nrf_drv_twi_tx %x %u\n\r",SI7021_ADDR,reg[0]);
    				err_code = nrf_drv_twi_tx(&my_twi_0, SI7021_ADDR, reg, 1, false);
    				APP_ERROR_CHECK(err_code);
                } else if (twi_read_mode==SI7021_REG_TEMP_READ) {
                	humCent = (uint16_t)((12500 * humRaw) >> 16) - 600;
                	tempRaw = (uint16_t)m_sample[0] << 8 |m_sample[1];
					tempCent = (uint16_t)((17572 * tempRaw) >> 16) - 4685;
                                        tempF = (uint16_t) ((tempCent*1.8/100) + 32);
					// printf("Relative Humidity %d.%d%% and Temp %d.%d°F        \r",humCent/100,humCent%100,tempF,tempF%100);
					NRF_LOG_DEBUG("\r\n");
                                        reg[0] = SI7021_REG_HUM_READ;
    				twi_read_mode = reg[0];
    				NRF_LOG_DEBUG("nrf_drv_twi_tx %x %u\n\r",SI7021_ADDR,reg[0]);
    				err_code = nrf_drv_twi_tx(&my_twi_0, SI7021_ADDR, reg, 1, false);
    				APP_ERROR_CHECK(err_code);
					//si7021_sensor_update(humRaw,tempRaw);
                }
            }
            m_xfer_done = true;
        
        default:
        // do nothing
        NRF_LOG_DEBUG("twi_handler default\n\r");
          break;
    }
    
