MAHFUZ121097/nRF52--Real-time-Ambulatory-Monitoring/main.c
}

//Initialize the TWI as Master device
void twi_master_7021_init(void)
{
    ret_code_t err_code;

    // Configure the settings for twi communication
    const nrf_drv_twi_config_t twi_config1 = {
       .scl                = TWI_SCL_M1,  //SCL Pin
       .sda                = TWI_SDA_M1,  //SDA Pin
       .frequency          = NRF_DRV_TWI_FREQ_100K, //Communication Speed
       .interrupt_priority = APP_IRQ_PRIORITY_LOW, //Interrupt Priority(Note: if using Bluetooth then select priority carefully)
       .clear_bus_init     = true //automatically clear bus
    };


    //A function to initialize the twi communication
    err_code = nrf_drv_twi_init(&my_twi_0, &twi_config1, twi_si7021_handler, NULL);
    APP_ERROR_CHECK(err_code);
    
    //Enable the TWI Communication..
    nrf_drv_twi_enable(&my_twi_0);
twi_read_mode = SI7021_REG_HUM_READ;
	NRF_LOG_DEBUG("nrf_drv_twi_tx %x %u\n\r",SI7021_ADDR,twi_read_mode);
	err_code = nrf_drv_twi_tx(&my_twi_0, SI7021_ADDR, &twi_read_mode, 1, false);
	APP_ERROR_CHECK(err_code);
    
}

// Function to process ECG data and detect peaks
void detectPeaksAndCalculateHR() {
    int lastRPeakTime = 0;
    int peakCount = 0;
    int rPeakTimes[BUFFER_SIZE / MIN_RR_INTERVAL]; // To store times of detected R-peaks

    for (int i = WINDOW_SIZE; i < BUFFER_SIZE - WINDOW_SIZE; i++) {
        float windowMax = 0;
        for (int j = i - WINDOW_SIZE; j <= i + WINDOW_SIZE; j++) {
            if (ecgBuffer[j] > windowMax) {
                windowMax = ecgBuffer[j];
            }
        }

        // Detect a peak if it's above the threshold
        if (ecgBuffer[i] == windowMax && ecgBuffer[i] > THRESHOLD) {
            int currentTime = i; // Time in milliseconds based on buffer index

            // Ensure minimum R-R interval (no false peaks)
            if (currentTime - lastRPeakTime >= MIN_RR_INTERVAL) {
                rPeakTimes[peakCount] = currentTime;
                peakCount++;
                lastRPeakTime = currentTime;
            }
        }
    }

    // Calculate heart rate from the R-peaks detected
    if (peakCount > 1) {
        int totalRRInterval = 0;
        for (int i = 1; i < peakCount; i++) {
            totalRRInterval += (rPeakTimes[i] - rPeakTimes[i - 1]);
        }

        int averageRRInterval = totalRRInterval / (peakCount - 1);
        float heartRate = 60000.0 / averageRRInterval; // Convert R-R interval to BPM
        printf("Hear rate: %f\n", heartRate);

        // Serial.print("Heart Rate: ");
        // Serial.println(heartRate);
    } else {
        // Serial.println("No peaks detected or insufficient peaks to calculate heart rate.");
    }

    // Reset buffer and index after processing
    ecgBufferIndex = 0;
    bufferFull = false;
}

// Function to fill the ECG buffer with adc_buffer data
void fillECGBuffer() {
    for (int i = 0; i < ADC_BUFFER_SIZE; i++) {
        if (ecgBufferIndex < BUFFER_SIZE) {
            // Store the filtered adc_buffer sample into the ecgBuffer
            float filtered = lowPassFilter(adc_buffer[i]);
            filtered = highPassFilter(filtered);
            filtered = derivative(filtered);
            filtered = filtered * filtered;
            filtered = movingWindowIntegrator(filtered);

            ecgBuffer[ecgBufferIndex] = filtered;
            ecgBufferIndex++;
        }

        // Check if the ECG buffer is full (5000 samples)
        if (ecgBufferIndex >= BUFFER_SIZE) {
            bufferFull = true;

            // Process the ECG buffer to detect peaks and calculate heart rate
            detectPeaksAndCalculateHR();
            break; // Exit loop as the buffer is full
        }
    }
}

/**@brief Application main function.
 */
int main(void)
{
    bool erase_bonds;
    //uint16_t length = SAADC_SAMPLES_IN_BUFFER*2;
    //uint8_t printf_buffer[SAADC_SAMPLES_IN_BUFFER*2];
    // Initialize.
    uint16_t temp_data, humd_data;
    uart_init();
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    nrf_gpio_cfg_output(22);
    nrf_gpio_cfg_output(5);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
//  twi_master_7021_init();
max_twi_init();
//  twi_master_7021_init();
twi_master_init();
    while (mpu6050_init()== false){
 NRF_LOG_INFO("MPU not started.");
}      

    saadc_sampling_event_init();
    
    saadc_sampling_event_enable();
    saadc_init();
    
advertising_start();
    // Start execution.
    printf("\r\nUART started.\r\n");
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
    

    // Enter main loop.
    for (;;)
    {
        if (NRF_LOG_PROCESS() == false){
   

       if (data_ready==1){
        if (MPU6050_ReadAcc(&AccValue[0], &AccValue[1], &AccValue[2]) == true)
        {
            
            printf_buffer[96] = 0x00;
            printf_buffer[97] = AccValue[0];
            printf_buffer[98] = AccValue[0] >> 8;
            printf_buffer[99] = AccValue[1];
            printf_buffer[100] = AccValue[1] >> 8;
            printf_buffer[101] = AccValue[2];
            printf_buffer[102] = AccValue[2] >> 8;
            printf_buffer[103] = 0xFF;  
            
        //nrf_gpio_pin_set(5);

        }
        //nrf_delay_ms(10);

     
max30100_init();
        max30100_read_sensor_data(&ir_data, &red_data);
            printf_buffer[104] = 0x00;
            // printf_buffer[105] = humCent/100;
            // printf_buffer[106] = (humCent/100) >> 8;
            // printf_buffer[107] = tempF;
            // printf_buffer[108] = (tempF) >> 8;
            printf_buffer[105] = ir_data;
            printf_buffer[106] = (ir_data) >> 8;
            printf_buffer[107] = red_data;
            printf_buffer[108] = (red_data) >> 8;
            printf_buffer[109] = 0xFF;
       
        
        si7021_read_sensor_data(&temp_data, &humd_data);
        
       
            printf_buffer[110] = 0x00;
            printf_buffer[111] = humd_data;
            printf_buffer[112] = humd_data >> 8;
            printf_buffer[113] = temp_data;
            printf_buffer[114] = temp_data >> 8;
            printf_buffer[115] = 0xFF;
           ble_nus_data_send(&m_nus, printf_buffer, &length, m_conn_handle);
           data_ready=0;

        //    fillECGBuffer();

           
           
           //nrf_delay_ms(100);
       }
        }
        idle_state_handle();
    }
}



// Low-pass filter (sample implementation, adjust coefficients as needed)
float lowPassFilter(float x) {
    static float y[2] = {0, 0};
    static float x_old[13] = {0};

    y[0] = y[1];
    y[1] = 2 * y[0] - x_old[12] + (2 * x - 2 * x_old[6] + x_old[12]) / 32;

    for (int i = 12; i > 0; i--) {
        x_old[i] = x_old[i - 1];
    }
    x_old[0] = x;

    return y[1];
}

// High-pass filter (sample implementation, adjust coefficients as needed)
float highPassFilter(float x) {
    static float y[2] = {0, 0};
    static float x_old[33] = {0};

    y[0] = y[1];
    y[1] = y[0] - x / 32 + x_old[16] - x_old[32] + x_old[31] / 32;

    for (int i = 32; i > 0; i--) {
        x_old[i] = x_old[i - 1];
    }
    x_old[0] = x;

    return y[1];
}

// Derivative function (emphasizes high slope changes)
float derivative(float x) {
    static float x_old[5] = {0};

    float y = (2 * x + x_old[1] - x_old[3] - 2 * x_old[4]) / 8;

    for (int i = 4; i > 0; i--) {
        x_old[i] = x_old[i - 1];
    }
    x_old[0] = x;

    return y;
}

// Moving window integrator (averages the signal)
float movingWindowIntegrator(float x) {
    static float x_old[BUFFER_SIZE] = {0};
    float y = 0;

    for (int i = BUFFER_SIZE - 1; i > 0; i--) {
        x_old[i] = x_old[i - 1];
        y += x_old[i];
    }
    x_old[0] = x;
    y += x_old[0];

    return y / BUFFER_SIZE;
}

/**
 * @}
 */
